Repository: vunguyen-dmt/xblock-poll
Catalog: poll/translations/*/LC_MESSAGES/text.po
Languages: vi

source: Whether or not to display results to the user.
vi: Hiển thị hoặc không hiển thị kết quả cho người dùng.

source: The maximum number of times a user may send a submission.
vi: Số lần tối đa người dùng có thể gửi bài.

source: Number of times the user has sent a submission.
vi: Số lần người dùng đã gửi bài.

source: Text to display after the user votes.
vi: Văn bản hiển thị sau khi người dùng bình chọn.

source: '{field}' is not present, or not a JSON array.
vi: '{field}' không xuất hiện hoặc không phải là mảng JSON.

source: {noun} {item} not a javascript object!
vi: {noun} {item} không phải là đối tượng javascript!

source: {noun} {item} contains no key.
vi: {noun} {item} không chứa khóa.

source: {noun} has no text or img. Please make sure all {noun_lower}s have one or the other, or both.
vi: {noun} không có văn bản hoặc hình ảnh. Vui lòng đảm bảo rằng tất cả các {noun_lower} đều có cái này hoặc cái kia, hoặc cả hai.

source: {noun} was added with no label. All {noun_lower}s must have labels. Please check the form. Check the form and explicitly delete {noun_lower}s if not needed.
vi: {noun} đã được thêm mà không có nhãn. Tất cả các {noun_lower} đều phải có nhãn. Vui lòng kiểm tra biểu mẫu. Kiểm tra biểu mẫu và xóa các {noun_lower} nếu không cần thiết.

source: All images must have an alternative text describing the image in a way that would allow someone to answer the poll if the image did not load.
vi: Tất cả hình ảnh phải có văn bản mô tả thay thế hình ảnh theo cách cho phép ai đó trả lời cuộc thăm dò nếu hình ảnh không tải.

source: You must include at least one {noun_lower}.
vi: Bạn phải bao gồm ít nhất một {noun_lower}.

source: Maximum Submissions missing or not an integer.
vi: Số lần gửi tối đa bị thiếu hoặc không phải là số nguyên.

source: Private results may not be False when Maximum Submissions is not 1.
vi: Kết quả cá nhân không được sai khi Số lần gửi tối đa không phải là 1.

source: Poll
vi: Thăm dò ý kiến

source: What is your favorite color?
vi: Màu sắc ưa thích của bạn là gì?

source: Red
vi: Màu đỏ

source: Blue
vi: Màu xanh dương

source: Green
vi: Màu xanh lá

source: Other
vi: Khác

source: The answer options on this poll.
vi: Các lựa chọn trả lời trong cuộc thăm dò này.

source: Total tally of answers from students.
vi: Tổng số câu trả lời của học viên.

source: The student's answer
vi: Câu trả lời của học viên

source: You have already voted in this poll.
vi: Bạn đã bỏ phiếu trong cuộc thăm dò này.

source: Answer not included with request.
vi: Câu trả lời không kèm theo yêu cầu.

source: No key "{choice}" in answers table.
vi: Không có khóa "{choice}" trong bảng câu trả lời.

source: You have already voted as many times as you are allowed.
vi: Bạn đã bỏ phiếu nhiều lần nhất có thể

source: You must specify a question.
vi: Bạn phải chỉ định một câu hỏi.

source: Answer
vi: Đáp Án

source: Question
vi: Câu hỏi

source: Submissions count
vi: Số lần gửi

source: Survey
vi: Khảo sát

source: Yes
vi: Đúng

source: No
vi: Không

source: Maybe
vi: Có thể

source: Answer choices for this Survey
vi: Các lựa chọn trả lời cho Khảo sát này

source: Are you enjoying the course?
vi: Bạn có thích khóa học không?

source: Would you recommend this course to your friends?
vi: Bạn có muốn giới thiệu khóa học này cho bạn bè của mình không

source: Do you think you will learn a lot?
vi: Bạn có nghĩ mình sẽ học được nhiều không?

source: Questions for this Survey
vi: Câu hỏi cho khảo sát này

source: The user's answers
vi: Câu trả lời của người dùng

source: Not all questions were included, or unknown questions were included. Try refreshing and trying again.
vi: Không phải tất cả các câu hỏi đều được đưa vào, hoặc các câu hỏi chưa biết đều được đưa vào. Hãy thử làm mới và thử lại.

source: Found unknown answer '{answer_key}' for question key '{question_key}'
vi: Đã tìm thấy câu trả lời không xác định '{answer_key}' cho khóa câu hỏi '{question_key}'

source: Submit
vi: Gửi

source: Thank you.
vi: Cảm ơn

source: You have used %(submissions_count_s)s out of %(max_submissions_s)s submissions.
vi: Bạn đã sử dụng %(submissions_count_s)s trong số %(max_submissions_s)s bài nộp.

source: Feedback
vi: Phản hồi

source: View results
vi: Xem kết quả

source: Export results to CSV
vi: Xuất kết quả sang CSV

source: Download CSV
vi: Tải xuống CSV

source: Student data and results CSV available for download in the LMS.
vi: Dữ liệu học viên và kết quả CSV có sẵn để tải xuống trong LMS.

source: Display Name
vi: Tên hiển thị

source: Question/Prompt
vi: Câu hỏi/Nhắc nhở

source: %(link_start)sMarkdown Syntax%(link_end)s is supported.
vi: %(link_start)sCú pháp Markdown%(link_end)s được hỗ trợ.

source: Enter the prompt for the user.
vi: Nhập lời nhắc cho người dùng

source: %(link_start)sMarkdown Syntax%(link_end)s is supported.
vi: %(link_start)sCú pháp Markdown%(link_end)s được hỗ trợ.

source: This text will be displayed for the user as some extra feedback after they have submitted their response to the poll.
vi: Văn bản này sẽ được hiển thị cho người dùng dưới dạng một số phản hồi bổ sung sau khi họ gửi phản hồi cho cuộc thăm dò ý kiến.

source: Private Results
vi: Kết quả cá nhân

source: True
vi: Đúng

source: False
vi: Sai

source: If this is set to True, don't display results of the poll to the user.
vi: Nếu điều này được đặt thành Đúng, không hiển thị kết quả cuộc thăm dò cho người dùng.

source: Maximum Submissions
vi: Số lần gửi tối đa

source: Maximum number of times a user may submit a poll. %(bold_start)sSetting this to a value other than 1 will imply that 'Private Results' should be true.%(bold_end)s Setting it to 0 will allow infinite resubmissions.
vi: Số lần tối đa người dùng có thể gửi cuộc thăm dò ý kiến. %(bold_end)sViệc đặt giá trị này thành giá trị khác 1 sẽ ngụ ý rằng 'Kết quả cá nhân' phải đúng.%(bold_end)s Đặt giá trị này thành 0 sẽ cho phép gửi lại vô số lần.

source: Notes:
vi: Ghi chú:

source: If you change an answer's text, all students who voted for that choice will have their votes updated to the new text. You'll want to avoid changing an answer from something like 'True' to 'False', accordingly. If you delete an answer, any votes for that answer will also be deleted. Students whose choices are deleted may vote again, but will not lose course progress.
vi: Nếu bạn thay đổi văn bản của câu trả lời, tất cả học viên đã bình chọn cho lựa chọn đó sẽ được cập nhật phiếu bầu của họ thành văn bản mới. Vì vậy, bạn nên tránh thay đổi câu trả lời từ 'Đúng' thành 'Sai'. Nếu bạn xóa một câu trả lời, mọi phiếu bầu cho câu trả lời đó cũng sẽ bị xóa. Những học viên có lựa chọn bị xóa có thể bỏ phiếu lại, nhưng sẽ không mất tiến độ khóa học.

source: Questions must be similarly cared for. If a question's text is changed, any votes for that question will remain. If a question is deleted, any student who previously took the survey will be permitted to retake it, but will not lose course progress.
vi: Các câu hỏi cũng phải được quan tâm tương tự. Nếu nội dung của câu hỏi bị thay đổi thì mọi phiếu bầu cho câu hỏi đó sẽ vẫn giữ nguyên. Nếu một câu hỏi bị xóa, bất kỳ học sinh nào đã tham gia cuộc khảo sát trước đó sẽ được phép thực hiện lại câu hỏi đó nhưng sẽ không mất tiến độ khóa học.

source: Add Answer
vi: Thêm câu trả lời

source: Add Question
vi: Thêm câu hỏi

source: Save
vi: Lưu

source: Cancel
vi: Hủy bỏ

source: You have used %(submissions_count_s)s out of %(max_submissions_s)s submissions.
vi: Bạn đã sử dụng %(submissions_count_s)s trong tổng số %(max_submissions_s)s bài gửi.
